HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
#if ( DET_AR_RELEASE_MAJOR_VERSION != 4U )
  #error "DET_AR_RELEASE_MAJOR_VERSION does not match. "
#endif
#if ( DET_AR_RELEASE_MINOR_VERSION != 0U )
  #error "DET_AR_RELEASE_MINOR_VERSION does not match. "
#endif

#endif /* (IFX_DET_VERSION_CHECK == STD_ON) */
#endif /*End for WDG_DEV_ERROR_DETECT */
/*----------------------------------------------------------------------------*/

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/


/* Masks the 16bit WDT reload value */
#define WDG_MASK_WDTREL                (0xFFFF0000U)
/* Sets the WDTHPW1 and ENDINIT bit in WDTCON0 */
#define WDG_SET_WDTHPW1_ENDINIT        (0x000000F1U)
/* Sets the WDTHPW1, ENDINIT and WDTLCK bit in WDTCON0 */
#define WDG_SET_WDTHPW1_ENDINIT_WDTLCK (0x000000F3U)
/* Sets the WDTIR bit and enables the watchdog by resetting WDTDR
   bit in WDTCON1 */
#define WDG_SET_WDTIR_RESET_WDTDR      (0x00000004U)
/* Resets the WDTIR bit and enables the watchdog by resetting WDTDR
   bit in WDTCON1 */
#define WDG_RESET_WDTIR_RESET_WDTDR    (0x00000000U)
/* Defines modify access value for WDTCON0 */
#define WDG_MODIFY_ACCESS              (0x000000F3U)
/* Clear WDTIR and WDTDR bits in SCU_WDTCPU0_CON0 as this field must
   be written with
   0's during a modify access to SCU_WDTCPU0_CON0.*/
#define WDG_CLEAR_WDTHPW0              (0xFFFFFFF3U)
/* Mask for Watchdog status in WDTSR*/
#define WDG_STATUS_MASK                 (0x0000003CU)
/* Watchdog Input Clock Status Flag Mask in WDTSR*/
#define WDG_INPUT_CLOCK_STATUS         (0x04U)
/* This is the reload value which will triiger an almost instant reset */
#define WDG_INSTANT_RESET_RELOAD_VALUE (0xFFFFU) /* 1 tick near reset */
/* Password field in CON0 */
#define WDG_MASK_WDTPW                 (0x0000FF00U)
/* Shift value of REL in WDTCPU0CON0 SFR*/
#define WDG_REL_SHIFT_VALUE             (16U)
/* Max Reload Value for ATOM channel*/
#define WDG_ATOM_MAX_VAL               (0x00FFFFFFU)
/* Max Reload Value for TOM channel*/
#define WDG_TOM_MAX_VAL                (0x0000FFFFU)
/* Conversion factor from Ticks to Time*/
#define WDG_TICKS_CONVERSION_FACTOR    ((uint32)1000U)

/* Slace factor from Time. All time related variables are in microsec */
#define WDG_TIME_SCALE_FACTOR          ((uint32)1000U)

#define WDG_TICKS_TO_TIME_CONV_FACTOR  ((uint32)(WDG_TICKS_CONVERSION_FACTOR\
                                       WDG_TIME_SCALE_FACTOR))




                                       /* Register Mapping for WDG */
#define WDG_REGMAP              ((Ifx_SCU_WDTCPU *)(void *) &(SCU_WDTCPU0_CON0))


/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/
#define WDG_17_SCU_START_SEC_CODE
#include "MemMap.h"


/* Function to Access password before accessing ENDINIT registers */
IFX_LOCAL_INLINE uint32 Wdg_lAccessPassword(uint32 WdtCon0);

/* Function to Modify the ENDINIT registers */
IFX_LOCAL_INLINE uint32 Wdg_lReloadModifyAccess(uint16 ReloadValue);


#if (WDG_MAXQM_TIMERS != 0U)
/* WDGx QM initialization */
static void Wdg_lQmInit(const Wdg_17_Scu_ConfigType* ConfigPtr); 
  
/* Function to change mode of WDG. Available modes are WDGIF_OFF_MODE,
   WDGIF_SLOW_MODE and WDGIF_FAST_MODE*/
/*  [cover parentID=DS_NAS_WDG_PR734] [/cover]  */
static Std_ReturnType Wdg_lChangeMode(WdgIf_ModeType Mode);

/*Function to operate the Service timer in respective WDG mode */
static void Wdg_lStartOrStopTimeEngine(WdgIf_ModeType Mode);

/* Function to calculate Timeout counter */
static void Wdg_lTimeoutHandler(WdgIf_ModeType Mode, uint16 timeout);

/* Function to trigger the Watchdog Hardware cyclically */
static void Wdg_lTrigger(void);
  
#if (WDG_DEV_ERROR_DETECT == STD_ON)
/* Function to check if hardware specific Configuration paramenters
are in range */
static Std_ReturnType Wdg_lInitParamRangeCheck(void);

/* Funtion to check for DET during Mode Change for WDG */
static Std_ReturnType Wdg_lSetModeDetCheck(WdgIf_ModeType Mode);

#endif
 /* (WDG_DEV_ERROR_DETECT == STD_ON) */

#endif/*WDG_MAXQM_TIMERS != 0U */

#if (WDG_DEV_ERROR_DETECT == STD_ON)
/* Funtion to check for DET during WDG Init */
static Std_ReturnType Wdg_lInitDetCheck(const Wdg_17_Scu_ConfigType* ConfigPtr);

#endif

#define WDG_17_SCU_STOP_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/


/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/

#if(WDG_PB_FIXEDADDR == STD_ON)
#define WDG_17_SCU_START_SEC_CONST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h" 
/* To store the Wdg driver configuration pointer (Fixed address) */
/*  TRACEABILITY: [cover parentID=DS_NAS_WDG_PR115][/cover] */
const Wdg_17_Scu_ConfigType * const Wdg_kConfigPtr = &Wdg_ConfigRoot[0];
#define WDG_17_SCU_STOP_SEC_CONST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
#endif  /*(WDG_PB_FIXEDADDR == STD_ON)*/

