HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/

#if(WDG_PB_FIXEDADDR == STD_OFF)

#define WDG_17_SCU_START_SEC_VAR_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/* To store the Wdg Driver configuration pointer */
const Wdg_17_Scu_ConfigType *Wdg_kConfigPtr;

#define WDG_17_SCU_STOP_SEC_VAR_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h" 
#endif /*(WDG_PB_FIXEDADDR == STD_OFF)*/

/* Below variales are available for WDG QM */
#if(WDG_MAXQM_TIMERS != 0U)

#define WDG_17_SCU_START_SEC_VAR_16BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*  [cover parentID=DS_AS40X_WDG153] [/cover]  */
#if (WDG_DEBUG_SUPPORT == STD_ON)
/* Wdg Timeout counter */
/*IFX_MISRA_RULE_08_10_STATUS=Variable Wdg_TimeoutCounter is declared as
 extern in Wdg_17_Scu_Dbg.h, which will be included application for
 debugging*/
uint16 Wdg_TimeoutCounter[WDG_MAX_TIMERS];
#else
static uint16 Wdg_TimeoutCounter[WDG_MAX_TIMERS];
#endif /*(WDG_DEBUG_SUPPORT == STD_ON)*/

static uint16 Wdg_CurrentReloadValue[WDG_MAX_TIMERS];

#define WDG_17_SCU_STOP_SEC_VAR_16BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define WDG_17_SCU_START_SEC_VAR_UNSPECIFIED
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*  [cover parentID=DS_AS40X_WDG152] [/cover]  */
#if (WDG_DEBUG_SUPPORT == STD_ON)
/* Driver Internal State, Assigned Default state: WDG_UNINIT */
/*IFX_MISRA_RULE_08_10_STATUS=Variable Wdg_17_Scu_DriverState is declared as
 extern in Wdg_17_Scu_Dbg.h, which will be included application for
 debugging*/
Wdg_17_Scu_StatusType Wdg_17_Scu_DriverState[WDG_MAX_TIMERS];
#elif (WDG_DEV_ERROR_DETECT == STD_ON)
/* Driver Internal State, Assigned Default state: WDG_UNINIT */
static Wdg_17_Scu_StatusType Wdg_17_Scu_DriverState[WDG_MAX_TIMERS];
#endif    /*(WDG_DEBUG_SUPPORT == STD_ON)*/

/*  [cover parentID=DS_AS40X_WDG154,DS_AS40X_WDG148] [/cover]  */
#if (WDG_DEBUG_SUPPORT == STD_ON)
/* Driver current mode */
/*IFX_MISRA_RULE_08_10_STATUS=Variable Wdg_17_Scu_DriverMode is declared as
 extern in Wdg_17_Scu_Dbg.h, which will be included application for
 debugging*/
WdgIf_ModeType Wdg_17_Scu_DriverMode[WDG_MAX_TIMERS];
#else
/* Driver current mode */
static WdgIf_ModeType Wdg_17_Scu_DriverMode[WDG_MAX_TIMERS];
#endif    /*(WDG_DEBUG_SUPPORT == STD_ON)*/

#define WDG_17_SCU_STOP_SEC_VAR_UNSPECIFIED
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
#endif 
/* WDG_MAXQM_TIMERS != 0U */
/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
#define WDG_17_SCU_START_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
** Syntax         :IFX_LOCAL_INLINE uint32 Wdg_lAccessPassword(uint32 WdtCon0) *
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : time (in ms)                                            **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32 (modified value)                                 **
**                                                                            **
** Description      : Function to Access password before accessing ENDINIT    **
**                      registers                                             **
**                      Password Access:                                      **
**       - (Bits[15:8])Set Hardware password WDTHPW1 TO 0                     **
**       - (Bits[7:4])Set Hardware password TO 1111                           **
**       - (Bits[3:2]) This field must be written with 0's during a password  **
**                   access to SCU_WDTCPU0_CON0.                              **
**       - (Bit[1]) Set WDTLCK to '0' to unlock SCU_WDTCPUx_CON0              **
**       - (Bit[0]) Set ENDINIT bit while password access                     **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Wdg_lAccessPassword(uint32 WdtCon0)
{

  return (uint32)((WdtCon0 & WDG_MASK_WDTREL) | WDG_SET_WDTHPW1_ENDINIT);
}

/*******************************************************************************
** Syntax           :IFX_LOCAL_INLINE uint32 Wdg_lReloadModifyAccess          **
**                                                (uint16 ReloadValue)        **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : ReloadValue (in ticks)                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32 (modified Value)                                 **
**                                                                            **
** Description      : Function to Modify the ENDINIT registers                **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Wdg_lReloadModifyAccess(uint16 ReloadValue)
{
  return(uint32)(((((uint32)(ReloadValue)) << WDG_REL_SHIFT_VALUE)&
                    WDG_MASK_WDTREL)|WDG_MODIFY_ACCESS);
}

