HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_WDG064, DS_AS_WDG001,
                      DS_AS_WDG019, DS_AS_WDG025, DS_AS_WDG089,DS_AS40X_WDG173,
                      DS_AS_WDG101, DS_AS_WDG051,DS_AS_WDG106_WDG100,
                      DS_NAS_WDG_PR759_PR760_PR761,DS_MCAL_WDG_050]           **
**                                                                            **
** Syntax           : void Wdg_17_Scu_Init( const Wdg_17_Scu_ConfigType       **
**                                                            *ConfigPtr )    **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : 0                                                       **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : ConfigPtr (Pointer to configuration set)                **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : Driver Module Initialization function. This routine     **
**                    initializes the watchdog driver and watchdog hardware   **
**                    i.e it sets the default watchdog mode and timeout       **
**                    period as provided in the configuration set. This       **
**                    configuration set shall be chosen from a limited number **
**                    of statically configured sets.                          **
**                    - WDG001: WDG028:                                       **
*******************************************************************************/
void Wdg_17_Scu_Init(const Wdg_17_Scu_ConfigType* ConfigPtr)
{
  uint8 CoreId;
  
  #if(WDG_DEV_ERROR_DETECT == STD_ON)
  /* Flag to indiate any DET/DEM Error. */
  Std_ReturnType ErrorFlag;
  #endif
    /*(WDG_DEV_ERROR_DETECT == STD_ON) */
  #if (WDG_MAXSAFE_TIMERS != 0U)
  uint8 SafeArrayIdx;
  uint16 PasswordInit;
  #endif

  CoreId = Mcal_GetCoreId();
  

  /* Wdg_lInitDetCheck checks ConfigPtr */
  #if (WDG_DEV_ERROR_DETECT == STD_ON)
  ErrorFlag = Wdg_lInitDetCheck(ConfigPtr);
  if(ErrorFlag != E_NOT_OK)
  #endif
   /*(WDG_DEV_ERROR_DETECT == STD_ON)*/
  {
    #if(WDG_PB_FIXEDADDR == STD_OFF)
    Wdg_kConfigPtr = ConfigPtr;
    #else
    UNUSED_PARAMETER(ConfigPtr)
    #endif
    
    #if (WDG_MAXQM_TIMERS != 0U)
    /*WDGx QM driver initialization */
    if(Wdg_kConfigPtr->WdgSafetyProperty[CoreId] == 0U)
    {
      Wdg_lQmInit(Wdg_kConfigPtr);
    }/* WdgSafetyProperty[CoreId]==0U */
    #endif
  
    #if (WDG_MAXSAFE_TIMERS != 0U)
    /*WDGx safety driver initialization */ 
    if(Wdg_kConfigPtr->WdgSafetyProperty[CoreId] == 1U)
    {
      /* Get the index value for Initial password */
      SafeArrayIdx = (uint8)ConfigPtr->WdgSafeIndex[CoreId];

      /* get initial password*/
      PasswordInit = (uint16)ConfigPtr->InitialPassword[SafeArrayIdx];

      Wdg_lSafetyInit(Wdg_kConfigPtr, PasswordInit); 
    }/* WdgSafetyProperty[CoreId] == 1U */
    #endif
    
  } /* End of (ErrorFlag != E_NOT_OK) */
}/* End of Wdg_17_Scu_Init */

#if (WDG_MAXQM_TIMERS != 0U)
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_WDG064, DS_AS40X_WDG016,
                      DS_AS_WDG017, DS_AS_WDG018, DS_AS_WDG026,DS_AS_WDG107,
                      DS_AS_WDG031, DS_AS_WDG091, DS_AS_WDG103,DS_AS_WDG160,
                      DS_NAS_WDG_PR759_PR760_PR761]                           **
**                                                                            **
** Syntax           : Std_ReturnType Wdg_17_Scu_SetMode( WdgIf_ModeType Mode )**
**                    [/cover]                                                **
**                                                                            **
** Service ID       : 1                                                       **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters (in)  : WdgIf_ModeType Mode                                     **
**                      One of the following statically configured modes:     **
**                      1. WDGIF_OFF_MODE                                     **
**                      2. WDGIF_SLOW_MODE                                    **
**                      3. WDGIF_FAST_MODE                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : Std_ReturnType (E_OK or E_NOT_OK)                       **
**                                                                            **
** Description      : By choosing one of a limited number of statically       **
**                    configured settings (e.g. toggle or window watchdog,    **
**                    different timeout periods) the watchdog driver and      **
**                    hardware can be switched between the following three    **
**                    different watchdog Modes Off or Slow or Fast:           **
**                    - WDG004:, WDG031:                                      **
*******************************************************************************/
Std_ReturnType Wdg_17_Scu_SetMode(WdgIf_ModeType Mode)
{
  uint16 TimeoutValue;
  WdgIf_ModeType PreviousMode;
  uint8 GtmModuleNumber;
  uint8 GtmChannelNumber;
  uint8 GtmArrayIdx;
  
  
