HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
  /* Return value indicating the result of this function execution:
       E_NOT_OK or E_OK*/
  Std_ReturnType ReturnValue;
  uint8 CoreId;
  CoreId = Mcal_GetCoreId();
  /* Report the development errors only if WDG_DEV_ERROR_DETECT is STD_ON */
  #if (WDG_DEV_ERROR_DETECT == STD_ON)
  /* Check for Idle State WDG017: */
  ReturnValue = Wdg_lSetModeDetCheck(Mode);

  if (ReturnValue==E_OK)
  #endif
  {
    /* Check if the Wachdog disable is not allowed */
    #if (WDG_DISABLE_ALLOWED == STD_OFF)
    /* Check if the requested mode is OFF_MODE but WDG Disable is not allowed,
       then report error */
    if (Mode == WDGIF_OFF_MODE)
    {
      #if (WDG_DISABLE_REJECT_DEM_REPORT == ENABLE_DEM_REPORT)
      /* Report Production errors to DEM - WDG010: WDG012: WDG026: WDG025:*/
      Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_DISABLE_REJECTED,
                             DEM_EVENT_STATUS_FAILED);
      #endif
      /* Set error flag */
      ReturnValue = E_NOT_OK;
    }
    else
    {
      ReturnValue = E_OK;
    }

    if(ReturnValue == E_OK)
    #endif
    /* (WDG_DISABLE_ALLOWED == STD_OFF) */
    {
      GtmArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];     
      /* Enter the critical section */
      SchM_Enter_Wdg_17_Scu_TimerHandling();

      #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
      /* Set Driver State to Busy - WDG018: */
      Wdg_17_Scu_DriverState[CoreId] = WDG_BUSY;
      #endif  
      /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/

      /* Hold the previous mode information */
      PreviousMode = Wdg_17_Scu_DriverMode[CoreId];
      /* Diasble GTM channel before mode change*/
      /*Read GTM module number  */
      GtmModuleNumber = \
               Wdg_kConfigPtr->GtmConf[GtmArrayIdx].GtmModuleNumberForService;
      /*Read GTM channel number  */
      GtmChannelNumber = \
                Wdg_kConfigPtr->GtmConf[GtmArrayIdx].GtmChannelNumberForService;
      
     /* ATOM/TOM channel module is disabled*/
        Wdg_lDisableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber);
      
        /* Set WDG to the given Mode */
      ReturnValue = Wdg_lChangeMode(Mode);

      /* Check if there was an error during mode switching */
      if (ReturnValue != E_OK)
      {
        #if (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT)

        /* Report Production errors to DEM - WDG010: WDG012: WDG016: */
        Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_MODE_FAILED,
                                DEM_EVENT_STATUS_FAILED);

        #endif
         /* #if (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT) */
      }
      else
      {
           /* Update the current mode of Wdg driver */
        Wdg_17_Scu_DriverMode[CoreId] = Mode;
        if(PreviousMode == WDGIF_OFF_MODE)
        {
          /* Wdg_TimeoutCounter will be set in the next
                         Wdg_17_Scu_SetTriggerCondition call which should be
                         done immediately,in case of transition from OFF mode
                         to any other mode.*/
          TimeoutValue = WDG_INITIAL_TIMEOUT;
            
        }
        else if(PreviousMode == WDGIF_SLOW_MODE)
        {
          TimeoutValue = Wdg_TimeoutCounter[CoreId] *
            Wdg_kConfigPtr->GtmConf[GtmArrayIdx].SlowServiceGtmCbkTime;
        } 
        else 
        {
          TimeoutValue = Wdg_TimeoutCounter[CoreId] * 
               Wdg_kConfigPtr->GtmConf[GtmArrayIdx].FastServiceGtmCbkTime;
        }
        /* Calculate Timeout counter for the remaining timeout value */
        Wdg_lTimeoutHandler(Wdg_17_Scu_DriverMode[CoreId],TimeoutValue);
        Wdg_lStartOrStopTimeEngine(Mode);
      }
      
      #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
      /* Set Driver State to Idle - WDG018: */
      Wdg_17_Scu_DriverState[CoreId] = WDG_IDLE;
      #endif
      /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/

      /* Exit the critical section */
      SchM_Exit_Wdg_17_Scu_TimerHandling();

    }
  }

  /* Return the end status of execution of this function */
  return (ReturnValue); /* WDG032: WDG008: */

}/* End of Wdg_17_Scu_SetMode */

/*******************************************************************************
** Traceability     : [cover parentID= DS_AS40X_WDG144,
                    DS_AS40X_WDG146, DS_AS40X_WDG155,
                    DS_NAS_WDG_PR759_PR760_PR761]                             **
**                                                                            **
** Syntax           : void Wdg_17_Scu_SetTriggerCondition(uint16 timeout)     **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : 0x03                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : uint16 timeout                                          **
**                    Timeout value (milliseconds) for setting the trigger    **
**                    counter.                                                **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : The function Wdg_17_Scu_SetTriggerCondition shall sets  **
**                    Timeout value (milliseconds) for setting the trigger    **
**                    counter - WDG144:                                       **
**                                                                            **
*******************************************************************************/
void Wdg_17_Scu_SetTriggerCondition(uint16 timeout)
{

  uint8 CoreId;
  CoreId = Mcal_GetCoreId();
  #if ( (WDG_DEV_ERROR_DETECT == STD_ON) && (WDG_MAX_TIMEOUT < 65535U) )
  /* When development error detection is enabled for the module, check that the
     timeout parameter given is less or equal to the maximum timeout value
     (WdgMaxTimeout)  WDG146:*/
  /* To avoid compiler warning "condition is always false" */
  if(timeout > (uint16)WDG_MAX_TIMEOUT )
  {
    /* REPORT TO DET - WDG010: WDG045: WDG035: WDG066:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_TRIGGER_CONDITION, WDG_E_PARAM_TIMEOUT );
  }
  else
  #endif 
  /* #if (WDG_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Enter the critical section*/
    SchM_Enter_Wdg_17_Scu_TimerHandling();

    /*Restart the GTM timer after setting the new window time*/
    Wdg_lStartOrStopTimeEngine(Wdg_17_Scu_DriverMode[CoreId]);

    /* Calculate Timeout counter for the new timeout parameter */
    Wdg_lTimeoutHandler(Wdg_17_Scu_DriverMode[CoreId],
                            timeout);

