HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
    /* Exit the critical section*/
    SchM_Exit_Wdg_17_Scu_TimerHandling();
  }
} /* End of Wdg_17_Scu_SetTriggerCondition  */


/*******************************************************************************
**                      Private Function Definitions                          **
*******************************************************************************/

/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_WDG161, DS_AS40X_WDG136,
                    DS_AS_WDG093, DS_AS40X_WDG094,
                    DS_NAS_WDG_PR759_PR760_PR761]                             **
**                                                                            **
** Syntax           : static void Wdg_lTrigger( void )                        **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters (in)  : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : This routine triggers the watchdog hardware. It has to  **
**                    be called cyclically in order to prevent the            **
**                    watchdog hardware from expiring.                        **
*******************************************************************************/
static void Wdg_lTrigger(void)
{
  uint32 PasswordAccess;
  uint32 ModifyAccess;
  /* Local variable to hold the value of Watchdog Timer Control Register */
  uint32 WdtCon0;
  uint8 CoreId;
  CoreId = Mcal_GetCoreId();

  /* Password Access: WDG037:
   - (Bits[7:4])Set Hardware password to WDTHPW1 TO 1111.
   - (Bits[3:2])This field must be written with the value of the bits
                SCU_WDTCPU0_CON1.WDTDR and SCU_WDTCPU0_CON1.WDTIR.
   - (Bit[1])Set WDTLCK to '0' to unlock SCU_WDTCPU0_CON0.
   - (Bit[0])Write back the read ENDINIT bit.
  */
  /* Enter critical section - WDG040:*/
  SchM_Enter_Wdg_17_Scu_Trigger();
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    access the password from WDTCON0 SFR register */
  WdtCon0 = WDG_REGMAP[CoreId].CON0.U;

  /* Password Access: WDG037:  
     - (Bits[15:8])Set Hardware password WDTHPW1 TO 0
     - (Bits[7:4])Set Hardware password TO 1111
     - (Bits[3:2]) This field must be written with 0's during a password
                   access to SCU_WDTCPU0_CON0.
     - (Bit[1]) Set WDTLCK to '0' to unlock SCU_WDTCPUx_CON0
     - (Bit[0]) Set ENDINIT bit while password access
  */

  PasswordAccess = Wdg_lAccessPassword(WdtCon0);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password into WDTCON0 SFR register */
  WDG_REGMAP[CoreId].CON0.U = (uint32)PasswordAccess;  /* PASSWORD ACCESS */
  /* Modify Access: WDG009:
     - (Bits[15:8])Set Hardware password WDTHPW1 TO 0
     - (Bits[7:4])Set Hardware password TO 1111
     - (Bits[3:2]) This field must be written with 0's during a modify
                   access to SCU_WDTCPU0_CON0.
     - (Bit[1]) Set WDTLCK to '1' to unlock SCU_WDTCPUx_CON0
     - (Bit[0]) Set ENDINIT bit to '1' while modify access
  */
  ModifyAccess = PasswordAccess | WDG_SET_WDTHPW1_ENDINIT_WDTLCK;
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password into WDTCON0 SFR register */
  WDG_REGMAP[CoreId].CON0.U = (uint32)ModifyAccess;    /* MODIFY ACCESS */

  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    access the password from WDTCON0 SFR register */
  WdtCon0 =(uint32)WDG_REGMAP[CoreId].CON0.U;
  PasswordAccess = Wdg_lAccessPassword(WdtCon0);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password into WDTCON0 SFR register */
  WDG_REGMAP[CoreId].CON0.U = (uint32)PasswordAccess;/* PASSWORD ACCESS */
  /* Update with the existing Reload Value */
  ModifyAccess = Wdg_lReloadModifyAccess(Wdg_CurrentReloadValue[CoreId]);
  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password into WDTCON0 SFR register */
  WDG_REGMAP[CoreId].CON0.U = (uint32)ModifyAccess; /* RELOAD VALUE UPDATE */

  /* Exit critical section - WDG040: */
  SchM_Exit_Wdg_17_Scu_Trigger();

  return ;

} /* End of Wdg_lTrigger */

/*******************************************************************************
** Traceability     : [cover parentID=DS_NAS_WDG_PR759_PR760_PR761]           **
**                                                                            **
** Syntax           : static Std_ReturnType Wdg_lChangeMode(WdgIf_ModeType Mode)
**                                                                            **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : E_OK or E_NOT_OK                                        **
**                                                                            **
** Description      : This routine changes the mode of WDG to the given mode. **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Wdg_lChangeMode(WdgIf_ModeType Mode)
{
  Std_ReturnType ChangeModeDone;
  uint32 WdtCon0;
  uint16 ClockDivider;
  uint16 ReloadValue;
  #if (WDG_DISABLE_ALLOWED == STD_ON)
  uint8 TimeoutModeFlag;
  uint8 DisableFlag;
  #endif
  uint8 CoreId;
  uint8 ModeArrayIdx;
  /* Get core Id */
  CoreId = Mcal_GetCoreId();
  /* Get the WDGx mode index */
  ModeArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];
  
  /* Set the default error status to E_NOT_OK */
  ChangeModeDone = E_NOT_OK;
  
  #if (WDG_DISABLE_ALLOWED == STD_ON)
  /* Check if OFF-Mode is requested */
  if (Mode == WDGIF_OFF_MODE)
  {
    /* Reset ENDINIT bit in SCU_WDTCPU0_CON0 to modify SCU_WDTCPU0_CON1 */
    Mcal_ResetENDINIT();
    /* Request to Disable the Watchdog */
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the WDT disable bit into WDTCON1 SFR register */
    WDG_REGMAP[CoreId].CON1.B.DR =(uint8)1U;
    /* Set ENDINIT bit in SCU_WDTCPU0_CON0 to lock SCU_WDTCPU0_CON1 */
    Mcal_SetENDINIT();

    /* Check the status of disable watchdog request */

    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    read the TimeoutMode bit from WDT Status SFR register */
    TimeoutModeFlag = (uint8)WDG_REGMAP[CoreId].SR.B.TO;
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    read the WDT Disable bit from WDT Status SFR register */
    DisableFlag = (uint8)WDG_REGMAP[CoreId].SR.B.DS;
    if ( (1U==DisableFlag) && (0U==TimeoutModeFlag) )
    {
      /* ChangeMode was succesful */
      ChangeModeDone = E_OK;
    
