HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
    }
  }
  else /* Mode is WDGIF_SLOW_MODE  or WDGIF_FAST_MODE */
  
  #endif 
  /* #if (WDG_DISABLE_ALLOWED == STD_ON) */
  {
    /* Mode is WDGIF_SLOW_MODE*/
    if (Mode == WDGIF_SLOW_MODE)
    {
      /* Get the Clock divider for Slow mode */
      ClockDivider = WDG_RESET_WDTIR_RESET_WDTDR;
      /* Get the Reload value for Slow mode */
      ReloadValue  = Wdg_kConfigPtr->SlowModeReloadValue[ModeArrayIdx];
    }
    else /* WDGIF_FAST_MODE */
    {
      /* Get the Clock divider for Fast mode */
      ClockDivider = WDG_SET_WDTIR_RESET_WDTDR;
      /* Get the Reload value for Fast mode */
      ReloadValue  = Wdg_kConfigPtr->FastModeReloadValue[ModeArrayIdx];
    }
    /* Store the current reload value */
    Wdg_CurrentReloadValue[CoreId] = ReloadValue;
    /* Reset ENDINIT bit in SCU_WDTCPU0_CON0 to modify SCU_WDTCPU0_CON1 */
    Mcal_ResetENDINIT();
    /* Set the clock divider */
    /*IFX_MISRA_RULE_17_04_STATUS==Pointer arithmetic is used to efficiently
    write the ClockDivider value into WDTCON1 SFR register */
    WDG_REGMAP[CoreId].CON1.U = (uint32)ClockDivider;
    /* Set ENDINIT bit in SCU_WDTCPU0_CON0 to lock SCU_WDTCPU0_CON1 */
    Mcal_SetENDINIT();

    /* Enter critical section - WDG040:*/
    SchM_Enter_Wdg_17_Scu_ChangeMode();
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    access the password from WDTCON0 SFR register */
    WdtCon0 = (uint32)WDG_REGMAP[CoreId].CON0.U;
    /* PASSWORD ACCESS */
    WdtCon0 = Wdg_lAccessPassword(WdtCon0);
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password into WDTCON0 SFR register */
    WDG_REGMAP[CoreId].CON0.U = (uint32)WdtCon0;
    /* MODIFY ACCESS - WDG145:*/
    WdtCon0 = Wdg_lReloadModifyAccess(ReloadValue);
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password and reload value into WDTCON0 SFR register */
    WDG_REGMAP[CoreId].CON0.U = (uint32)WdtCon0;

    /* Exit critical section - WDG040: */
    SchM_Exit_Wdg_17_Scu_ChangeMode();

    /* Check for the used clock divider */
    if ( ClockDivider == WDG_SET_WDTIR_RESET_WDTDR)
    {
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      access the WDT Status SFR register to check Changemode was successful*/
      if (((uint32)WDG_REGMAP[CoreId].SR.U & WDG_STATUS_MASK) == \
                                               WDG_SET_WDTIR_RESET_WDTDR)
      {
        ChangeModeDone = E_OK; /* ChangeMode was succesful */
      }
    }
    else /* ClockDivider is WDG_CLK_DIVIDER_SLOW */
    {
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      access the WDT Status SFR register to check Changemode was successful*/
      if (((uint32)WDG_REGMAP[CoreId].SR.U & WDG_STATUS_MASK) == \
                                               WDG_RESET_WDTIR_RESET_WDTDR)
      {
        ChangeModeDone = E_OK; /* ChangeMode was succesful */
      }
    }/* End of 'if ( ClockDivider == WDG_SET_WDTIR_RESET_WDTDR)' */
    
  } /* End of 'if (Mode == WDGIF_SLOW_MODE)' */
  /* return E_OK if change mode done successfully */
  return ((Std_ReturnType)ChangeModeDone);
}

/*******************************************************************************
** Traceability     : [cover parentID=DS_NAS_WDG_PR759_PR760_PR761]           **
**                                                                            **
** Syntax           : static void Wdg_lStartOrStopTimeEngine                    
**                                                   (WdgIf_ModeType Mode)    **
**                                                                            **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : WdgIf_ModeType Mode                                     **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : This function starts SRV timer if watchdog SLOW-MODE    **
**                    or FAST-MODE is requested                               **
**                                                                            **
*******************************************************************************/
static void Wdg_lStartOrStopTimeEngine(WdgIf_ModeType Mode)
{
  uint32 GtmSlowTicks;
  uint32 GtmFastTicks;
  uint8 GtmModuleNumber;
  uint8 GtmChannelNumber;
  uint8 CoreId;
  uint8 GtmArrayIdx;
  /* Get core Id */
  CoreId = Mcal_GetCoreId();
  /* Get GTM index for WDGx */
  GtmArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];
  /* Enter critical section - WDG040:*/
  SchM_Enter_Wdg_17_Scu_TimerHandling();
  /*Get GTM module number  */
  GtmModuleNumber = (uint8)Wdg_kConfigPtr->GtmConf[GtmArrayIdx]. \
                                           GtmModuleNumberForService;
  /* Get GTM module channel number*/
  GtmChannelNumber = (uint8)Wdg_kConfigPtr->GtmConf[GtmArrayIdx].  \
                                          GtmChannelNumberForService;
  /* Get GTM slow ticks  */
  GtmSlowTicks = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].SlowServiceGtmCbkTicks;
  /* Get GTM fast ticks  */
  GtmFastTicks = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].FastServiceGtmCbkTicks;

   /* ATOM/TOM channel module is disabled*/
   Wdg_lDisableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber);

  switch(Mode)
  {
    case WDGIF_OFF_MODE:
    {
      break;
    }
    /* Start SRV timer with corresponding timer ticks value when Watchdog
     SLOW-Mode is requested */
    case WDGIF_SLOW_MODE:
    {
       /* ATOM/TOM channel is enabled*/
    Wdg_lEnableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber,
                                                         GtmSlowTicks);
  break;
    }
      /* Start SRV timer with corresponding timer ticks value when Watchdog
       FAST-Mode is requested */
    case WDGIF_FAST_MODE:
    {
        /* ATOM/TOM channel is enabled*/
     Wdg_lEnableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber,
                                                         GtmFastTicks);
    break;
    }
    default:
    {
      break;
    }
 }
  /* Exit the critical section */
  SchM_Exit_Wdg_17_Scu_TimerHandling();
}

