HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_WDG/Wdg_17_Scu.c
/*******************************************************************************
** Syntax           : static Std_ReturnType Wdg_lInitParamRangeCheck(void)    **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : E_OK or E_NOT_OK                                        **
**                                                                            **
** Description      : This function checks that the (hardware specific)       **
**                    contents of the given configuration set is within the   **
**                    allowed boundaries.                                     **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Wdg_lInitParamRangeCheck(void)
{
  WdgIf_ModeType Mode;
  Std_ReturnType Ret_Val;
  uint8 CoreId;
  CoreId = Mcal_GetCoreId();

  /* Check if GTM related configuration is within range */
  Ret_Val = Wdg_lGtmConfigCheck();
  /* Take the default value of the WDG Mode from configuration*/
  Mode = Wdg_kConfigPtr->DefaultMode[CoreId];
  if(Ret_Val != E_OK)
  {
    /* Report to DET - WDG090: WDG092*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                      WDG_SID_INIT, WDG_E_PARAM_CONFIG );
  }
  else if ( !((Mode == WDGIF_SLOW_MODE) || (Mode == WDGIF_FAST_MODE) ||
             (Mode == WDGIF_OFF_MODE)) )
  {
    /* Report to DET - WDG010: WDG045: WDG008: WDG066: WDG064: WDG091:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                      WDG_SID_INIT, WDG_E_PARAM_CONFIG );
    Ret_Val = E_NOT_OK;
  }
  else
  {
    /*Do Nothing*/
  }

  return (Ret_Val);
}

#endif
 /* (WDG_DEV_ERROR_DETECT == STD_ON) */
/*******************************************************************************
**                                                                            **
** Syntax           : static void Wdg_lQmInit(const Wdg_17_Scu_ConfigType*    **
**                                            ConfigPtr)                      **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : E_OK or E_NOT_OK                                        **
**                                                                            **
** Description      : This function initializes WDGx without safety           **
**                                                                            **
*******************************************************************************/
static void Wdg_lQmInit(const Wdg_17_Scu_ConfigType* ConfigPtr)
{ 
  /*Enter if Wdg_lInitDetCheck returns E_OK  */
  /* Variables for WDG init */
  Std_ReturnType ReturnValue;
  uint8 CoreId;
  
  #if((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DISABLE_ALLOWED == STD_OFF))
  /* Flag to indiate any DET/DEM Error. */
  Std_ReturnType ErrorFlag;
  #endif
  /*((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DISABLE_ALLOWED == STD_OFF))*/
   
  CoreId = Mcal_GetCoreId();
  #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
  /* Set Driver State to Uninit */
  Wdg_17_Scu_DriverState[CoreId] = WDG_UNINIT;
  #endif 
  /*(WDG_DEV_ERROR_DETECT == STD_ON) ||
                       (WDG_DEBUG_SUPPORT == STD_ON)*/
  /* Set driver to OFF mode*/
  Wdg_17_Scu_DriverMode[CoreId] = WDGIF_OFF_MODE;

  #if (WDG_DEV_ERROR_DETECT == STD_ON)
  
  ErrorFlag = Wdg_lInitParamRangeCheck();
  if(ErrorFlag != E_NOT_OK)
  #endif
   /*(WDG_DEV_ERROR_DETECT == STD_ON)*/
  {
    /* Check if the default mode is STD_OFF and WDG Disable is 
                                           not allowed */
    #if (WDG_DISABLE_ALLOWED == STD_OFF)
    /*Check if the defaule mode configured is Off-Mode*/
    if(ConfigPtr->DefaultMode[CoreId] == WDGIF_OFF_MODE)
    {
      #if (WDG_DISABLE_REJECT_DEM_REPORT == ENABLE_DEM_REPORT)
      /* Report Production errors to DEM -
                         WDG010: WDG012: WDG026: WDG025:*/
      Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_DISABLE_REJECTED,
                              DEM_EVENT_STATUS_FAILED);
      #endif
      /* Enable the error flag, as watchdog Disable is not allowed
             but default mode configured is Off-Mode (WDGIF_OFF_MODE) */
      ErrorFlag = E_NOT_OK;
    }
    else
    {
      ErrorFlag = E_OK;
    }
    if(ErrorFlag != E_NOT_OK)
    #endif
    /* WDG_DISABLE_ALLOWED == STD_OFF*/
    {
      /* Set WDG to the given Mode. Available modes are OFF_MODE,
          SLOW_MODE and FAST_MODE - WDG001, WDG100, WDG101*/
      ReturnValue = Wdg_lChangeMode(ConfigPtr->DefaultMode[CoreId]);
      /* Check if there was an error during mode switching */
      if (ReturnValue != E_OK)
      {
        /* Enter the critical section */
        SchM_Enter_Wdg_17_Scu_TimerHandling();
        /* Reset Wdg_TimeoutCounter */
        Wdg_TimeoutCounter[CoreId] = 0x00U;
        /* Exit the critical section */
        SchM_Exit_Wdg_17_Scu_TimerHandling();
        #if (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT)
        /* Report Production errors to DEM - WDG010: WDG012:
              WDG016: WDG173*/
        Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_MODE_FAILED,
                                DEM_EVENT_STATUS_FAILED);
        #endif 
        /* #if (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT)*/
        #if (WDG_DEV_ERROR_DETECT == STD_ON)
        /*Initialisation is unsuccessfull and Report to DET -
                   WDG010: WDG045:WDG003: WDG066: WDG064: WDG090:*/
        Det_ReportError( WDG_17_SCU_MODULE_ID,WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_INIT,WDG_E_PARAM_CONFIG );
        #endif
         /* #if (WDG_DEV_ERROR_DETECT == STD_ON) */
      } /* End of '(ReturnValue != E_OK)'*/
      /* If init is done successfuly calculate Timeout counter*/
      else
      {
        /* Calculate the Timeout counter */
        Wdg_lTimeoutHandler(ConfigPtr->DefaultMode[CoreId],
                             ((uint16)WDG_INITIAL_TIMEOUT));
        /*Start the SRV timer with respecive reload value if the default
                   watchdog mode is FAST-mode or SLOW-mode*/
        Wdg_lStartOrStopTimeEngine(ConfigPtr->DefaultMode[CoreId]);
        #if ((WDG_DEV_ERROR_DETECT == STD_ON) ||(WDG_DEBUG_SUPPORT == STD_ON))
        /* As the initialisation is successfull, set Driver State to Idle */
        Wdg_17_Scu_DriverState[CoreId] = WDG_IDLE;
        #endif 
        /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/

        /* Update the current mode of Wdg driver */
        Wdg_17_Scu_DriverMode[CoreId] = ConfigPtr->DefaultMode[CoreId];
      }  /* End of '(ReturnValue == E_OK)' */
    } /* ErrorFlag != E_NOT_OK, WDG_DISABLE_ALLOWED == STD_OFF  */ 
  } /*ErrorFlag != E_NOT_OK, WDG_DEV_ERROR_DETECT == STD_ON  */
  
  return;
}/* End of Wdg_lQmInit */  

#endif
 /* WDG_MAXQM_TIMERS != 0U */

#if (WDG_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
**                                                                            **
** Syntax           :   static Std_ReturnType Wdg_lInitDetCheck(void)         **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : E_OK or E_NOT_OK                                        **
**                                                                            **
** Description      : This function checks  the DET's during Initialization   **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Wdg_lInitDetCheck(const Wdg_17_Scu_ConfigType* ConfigPtr)
{
  /* Flag to indiate any DET/DEM Error. */
  Std_ReturnType ErrorFlag;
  /* Flag initialized to no error*/
  ErrorFlag = E_OK;

  #if(WDG_PB_FIXEDADDR == STD_OFF)
   /* Check if the passed parameter is a NULL_PTR.  If so, escalate... */
  if (ConfigPtr == NULL_PTR)
  {
    /* Report to DET - WDG010: WDG045: WDG003: WDG066: WDG064: WDG089:*/
    /* Traceability : [cover parentID=DS_AS40X_WDG111] [/cover] */
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_INIT, WDG_E_PARAM_CONFIG );
    ErrorFlag = E_NOT_OK;
  }
  #else
  /* Check for fixed configuration pointer & DET not reported previously*/
  if (ConfigPtr != Wdg_kConfigPtr)
  {
    /* Report to DET - WDG010: WDG045: WDG003: WDG066: WDG064:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_INIT, WDG_E_PARAM_CONFIG );
    ErrorFlag = E_NOT_OK;
  }
  #endif
   /*(WDG_PB_FIXEDADDR == STD_OFF)*/

  return (ErrorFlag) ;

